; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob85) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 349)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 272)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 95)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 75)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 77)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 27)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 66)
	(at crate5 distributor0)
	(on crate5 crate1)
	(= (weight crate5) 40)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 72)
	(at crate7 depot0)
	(on crate7 crate2)
	(= (weight crate7) 8)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 crate4)
		(on crate3 crate0)
		(on crate4 pallet2)
		(on crate5 pallet1)
		(on crate6 pallet0)
		(on crate7 crate1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 72
   goals met: 0 of 7
3. (lift hoist0 crate7 crate2 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate2)
   added: (lifting hoist0 crate7) (clear crate2)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 7
4. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 0 of 7
5. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 8
   goals met: 0 of 7
6. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 12 to 22
   goals met: 0 of 7
7. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 7
8. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 8 to 74
   goals met: 0 of 7
9. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 7
10. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 74 to 101
   goals met: 0 of 7
11. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 7
12. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 72 to 149
   goals met: 0 of 7
13. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck1) from 149 to 77
   goals met: 0 of 7
14. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 1 of 7
15. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 101 to 35
   goals met: 1 of 7
16. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 25 to 35
   goals met: 1 of 7
17. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 35 to 36
   goals met: 1 of 7
18. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 35 to 75
   goals met: 1 of 7
19. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 36 to 37
   goals met: 1 of 7
20. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 2 of 7
21. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   changed: (current_load truck0) from 75 to 150
   goals met: 2 of 7
22. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 150 to 123
   goals met: 2 of 7
23. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 37 to 47
   goals met: 2 of 7
24. (unload hoist2 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 123 to 48
   goals met: 2 of 7
25. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 47 to 57
   goals met: 2 of 7
26. (drop hoist2 crate1 crate4 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate4)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate4)
   goals met: 3 of 7
27. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 57 to 67
   goals met: 3 of 7
28. (unload hoist2 crate7 truck0 distributor1)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 48 to 40
   goals met: 3 of 7
29. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 67 to 77
   goals met: 3 of 7
30. (drop hoist2 crate7 crate1 distributor1)
   deleted: (lifting hoist2 crate7) (clear crate1)
   added: (available hoist2) (at crate7 distributor1) (clear crate7) (on crate7 crate1)
   goals met: 4 of 7
31. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 40 to 67
   goals met: 4 of 7
32. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 77 to 78
   goals met: 4 of 7
33. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 67 to 162
   goals met: 4 of 7
34. (unload hoist1 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck0) from 162 to 122
   goals met: 4 of 7
35. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 5 of 7
36. (unload hoist1 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck0) from 122 to 27
   goals met: 5 of 7
37. (drop hoist1 crate0 crate5 distributor0)
   deleted: (lifting hoist1 crate0) (clear crate5)
   added: (available hoist1) (at crate0 distributor0) (clear crate0) (on crate0 crate5)
   goals met: 6 of 7
38. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 27 to 0
   goals met: 6 of 7
39. (drop hoist1 crate3 crate0 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate0)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate0)
   goals met: 7 of 7
